Autodesk.Revit.DB.ExternalService.IExternalServiceProxy.OnServersChanged(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ExternalService.ServerChangeCause,System.Collections.Generic.IList`1{System.Guid})
Implement this method to handle situations when servers for the service have changed.
Remarks:
This method may only be invoked in a recordable service.
Services registered as non-recordable never receive this call.
It is imperative to understand this method is not called just when an active server (or servers)
is (are) changed for a service. It is invoked only when the active server is changed so it is
different from those previously used (i.e. actually executed) in a document. Because of that,
this notification is never sent when active server is set or reset in a document in which the
service was never executed before.
If a document has explicitly set active server (or servers), OnServersChanged is never called
for that document when the application-wide active server (servers) gets changed. The document
would still be executed with its own active servers applied.
A similar case is when the active server (servers) is unset for a document but the currently
active application-wide server happens to be the same as the one that was set in the document.
It is up to the service provider to decide what should be the appropriate action. In some cases,
if not all, the service will probably want to execute again, now with the new active server(s),
but that it is not necessary - the service invoker may as well decide to wait for the end-user
to trigger execution if the service (e.g. by clicking a corresponding command in the menu.)
document:
The corresponding document
cause:
Indicates in what situation the servers are changed. Currently available values indicate
whether the change is a result of an explicit user request, or by an implicit change of
situation within the service - for example when a document is updated upon opening.
oldServers:
Ids of servers previously used in the document. Please note that the Ids may
belong to servers that are not registered with service anymore.
Since:
2013

Autodesk.Revit.DB.ExternalService.IExternalServiceProxy.OnServersDisparity(Autodesk.Revit.DB.Document,System.Collections.Generic.IList`1{System.Guid})
Implements this method to get notified that the servers  in a just
opened document differ from those currently set as active for the service.
Remarks:
This method may only be invoked in a recordable service.
Services registered as non-recordable never receive this call.
This notification is sent when Revit opens a document which has a record of
the service used (executed at least once) and the record shows that the server
(or servers) used differ from those currently set as active for the service.
Unless the situation is explicitly handled in this call (by returning DoNothing),
the framework will follow up by assigning the formerly used servers as the
currently active servers of that document. After it will notify the service
about the change by invoking the OnServersChanged method on the services interface.
document:
The coresponding document
oldServers:
Ids of servers previously used in the document. Please note that the Ids may
belong to servers that are currently not registered with the service.
Returns:
Return DoNothing if the situation has been completely handled by your service;
If not, reply with either ApplyDefaults (typical case) or LetUserDecide.
Since:
2013